
## Plan Result

[CI link](https://github.com/morisoba00/aws-ecs-terraform/actions/runs/5099507965)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 0 to change, 2 to destroy.</code></pre>

* Create
  * aws_route53_zone.zone
* Delete
  * aws_route53_zone.d-wiki_zone
* Replace
  * aws_route53_record.record


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_route53_record.record must be replaced
-/+ resource "aws_route53_record" "record" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "d-wiki.com" -> (known after apply)
      ~ id                               = "Z080441839FKQW0XEUU54_d-wiki.com_A" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "d-wiki.com"
      - records                          = [] -> null
      - ttl                              = 0 -> null
      ~ zone_id                          = "Z080441839FKQW0XEUU54" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_route53_zone.d-wiki_zone will be destroyed
  # (because aws_route53_zone.d-wiki_zone is not in configuration)
  - resource "aws_route53_zone" "d-wiki_zone" {
      - arn                 = "arn:aws:route53:::hostedzone/Z080441839FKQW0XEUU54" -> null
      - comment             = "Managed by Terraform" -> null
      - force_destroy       = false -> null
      - id                  = "Z080441839FKQW0XEUU54" -> null
      - name                = "d-wiki.com" -> null
      - name_servers        = [
          - "ns-113.awsdns-14.com",
          - "ns-1268.awsdns-30.org",
          - "ns-1774.awsdns-29.co.uk",
          - "ns-948.awsdns-54.net",
        ] -> null
      - primary_name_server = "ns-1774.awsdns-29.co.uk" -> null
      - tags                = {} -> null
      - tags_all            = {} -> null
      - zone_id             = "Z080441839FKQW0XEUU54" -> null
    }

  # aws_route53_zone.zone will be created
  + resource "aws_route53_zone" "zone" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "d-wiki.com"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags_all            = (known after apply)
      + zone_id             = (known after apply)
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":23,"Program":"tfcmt","SHA1":"41e4e1c47d324675da2e450f74dc772637772e3a","Vars":{},"WorkflowName":"Terraform"} -->